new_doom/config.org
#+title: Literate Doom Emacs Config
#+author: Chris Girvin
#+date: 07-07-2021
#+email: chrisg8691@gmail.com
#+PROPERTY: header-args:emacs-lisp :tangle ./config.el

* Doom Emacs Config Starter Template
#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Chris Girvin"
      user-mail-address "chrisg8691@gmail.com")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;;(setq doom-theme 'doom-one)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
;;(setq display-line-numbers-type 'relative)

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
#+end_src
* Change Meta Key
#+begin_src emacs-lisp
(setq x-super-keysym 'meta)                     ; set 'super' key as 'meta'
#+end_src
* Auth Sources File Location
#+begin_src emacs-lisp
(setq auth-sources '("~/.authinfo.gpg")         ; use "~/.authinfo.gpg" instead of default location
      auth-source-cache-expiry nil)             ; auth sources queries never expire
#+end_src
* Simple Defaults
#+begin_src emacs-lisp
(setq-default
 delete-by-moving-to-trash t                    ; delete files to trash
 window-combination-resize t                    ; take new window space from all splits, not just current
 x-stretch-cursor t)                            ; stretch cursor to the glyph width

(setq undo-limit 80000000                       ; set undo limit to 80 Mb
      evil-want-fine-undo t                     ; granular changes in insert mode
      auto-save-default t                       ; enable autosaving
      truncate-string-ellipsis "…"              ; save space on "..."
      password-cache-expiry nil                 ; save passwords
      scroll-preserve-screen-position 'always   ; save cursor position
      scroll-margin 2)                          ; set scroll margin

(display-time-mode 1)                           ; display time in modeline

(display-battery-mode 1)                     ; display battery percentage in modeline

(global-subword-mode 1)                         ; iterate through camelCase words
#+end_src
* Frame Sizing
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(height . 24))
(add-to-list 'default-frame-alist '(width . 80))
#+end_src
* Windows
** Enter new window (split below or split right)
#+begin_src emacs-lisp
(setq evil-vsplit-window-right t
      evil-split-window-below t)
#+end_src
** Pull up ivy
#+begin_src emacs-lisp
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (+ivy/switch-buffer))
#+end_src
** Get previews
#+begin_src emacs-lisp
(setq +ivy-buffer-preview t)
#+end_src
** Window rotation is nice, and can be found under SPC w r and SPC w R. Layout rotation is also nice though. Let’s stash this under SPC w SPC, inspired by Tmux’s use of C-b SPC to rotate windows. We could also do with adding the missing arrow-key variants of the window navigation/swapping commands.
#+begin_src emacs-lisp
(map! :map evil-window-map
      "SPC"             #'rotate-layout
      ;; navigation
      "<left>"          #'evil-window-left
      "<down>"          #'evil-window-down
      "<up>"            #'evil-window-up
      "<right>"         #'evil-window-right
      ;; swapping windows
      "C-<left>"        #'+evil/window-move-left
      "C-<down>"        #'+evil/window-move-down
      "C-<up>"          #'+evil/window-move-up
      "C-<right>"       #'+evil/window-move-right)
#+end_src
* Better Defaults
** Start new buffers in org-mode
#+begin_src emacs-lisp
;;(setq-default major-mode 'org-mode)
#+end_src
* Visual Settings
** Font Face
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "Iosevka Nerd Font Mono" :style "Medium Oblique" :size 16)
      doom-big-font (font-spec :family "Iosevka Nerd Font Mono" :style "Medium Oblique" :size 24)
      doom-variable-pitch-font (font-spec :family "Overpass Nerd Font" :size 16)
      doom-unicode-font (font-spec :family "JuliaMono")
      doom-serif-font (font-spec :family "BlexMono Nerd Font" :weight 'light))
#+end_src
** Theme and Modeline
*** Theme
#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
(remove-hook 'window-setup-hook #'doom-init-theme-h )
(add-hook 'after-init-hook #'doom-init-theme-h 'append)
(delq! t custom-theme-load-path)
#+end_src
*** Modeline file location text color
#+begin_src emacs-lisp
(custom-set-faces!
  '(doom-modeline-buffer-modified :foreground "orange"))
#+end_src
*** Conditionally hide file encoding on modeline unless different than UTF-8
#+begin_src emacs-lisp
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (and (memq (plist-get (coding-system-plist buffer-file-coding-system) :category)
                                 '(coding-category-undecided coding-category-utf-8))
                           (not (memq (coding-system-eol-type buffer-file-coding-system) '(1 2))))
                t)))
(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding )
#+end_src
*** Relative line numbers
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src
*** Nicer default buffer names
#+begin_src emacs-lisp
(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")
#+end_src
** Window title - have just the buffer name, and if-applicable, the project folder
#+begin_src emacs-lisp
(setq frame-title-format
      '(""
        (:eval
         (if (s-contains-p org-roam-directory (or buffer-file-name ""))
             (replace-regexp-in-string
              ".*/[0-9]*-?" "☰ "
              (subst-char-in-string ?_ ? buffer-file-name))
           "%b"))
        (:eval
         (let ((project-name (projectile-project-name)))
           (unless (string= "-" project-name)
             (format (if (buffer-modified-p) " ◉ %s" "  ●  %s") project-name))))))
#+end_src
