new_doom/config.org
** Splash screen
#+begin_src emacs-lisp
;;(defvar fancy-splash-image-template
;;  (expand-file-name "./misc/splash-images/Doom_Game1.svg" doom-private-dir)
;;  "Default template svg used for the splash image, with substitutions from ")
;;
;;(defvar fancy-splash-sizes
;;  `((:height 300 :min-height 50  :padding (0 . 2))
;;    (:height 250 :min-height 42  :padding (2 . 4))
;;    (:height 200 :min-height 35  :padding (3 . 3))
;;    (:height 150 :min-height 28  :padding (3 . 3))
;;    (:height 100 :min-height 20  :padding (2 . 2))
;;    (:height 75  :min-height 15  :padding (2 . 1))
;;    (:height 50  :min-height 10  :padding (1 . 0))
;;    (:height 1   :min-height 0   :padding (0 . 0)))
;;  "list of plists with the following properties
;;  :height the height of the image
;;  :min-height minimum `frame-height' for image
;;  :padding `+doom-dashboard-banner-padding' (top . bottom) to apply
;;  :template non-default template file
;;  :file file to use instead of template")
;;
;;(defvar fancy-splash-template-colors
;;  '(("$color1" . keywords) ("$color2" . type) ("$color3" . base5) ("$color4" . base8))
;;  "list of the color-replacement alists of the form (\"$placeholder\" . 'theme-color) which is applied to the template")
;;
;;(unless (file-exists-p (expand-file-name "theme-splashes" doom-cache-dir))
;;  (make-directory (expand-file-name "theme-splashes" doom-cache-dir) t))
;;
;;(defun fancy-splash-filename (theme-name height)
;;  (expand-file-name (concat (file-name-as-directory "theme-splashes")
;;                            theme-name
;;                            "-" (number-to-string height) ".svg")
;;                    doom-cache-dir))
;;
;;(defun fancy-splash-clear-cache ()
;;  "Delete all cached fancy splash images"
;;  (interactive)
;;  (delete-directory (expand-file-name "theme-splashes" doom-cache-dir) t)
;;  (message "Cache cleared!"))
;;
;;(defun fancy-splash-generate-image (template height)
;;  "Read TEMPLATE and create an image if HEIGHT with color substitutions as described by `fancy-splash-template-colors' for the current theme"
;;  (with-temp-buffer
;;    (insert-file-contents template)
;;    (re-search-forward "$height" nil t)
;;    (replace-match (number-to-string height) nil nil)
;;    (dolist (substitution fancy-splash-template-colors)
;;      (goto-char (point-min))
;;      (while (re-search-forward (car substitution) nil t)
;;        (replace-match (doom-color (cdr substitution)) nil nil)))
;;    (write-region nil nil
;;                  (fancy-splash-filename (symbol-name doom-theme) height) nil nil)))
;;
;;(defun fancy-splash-generate-images ()
;;  "Perform `fancy-splash-generate-image' in bulk"
;;  (dolist (size fancy-splash-sizes)
;;    (unless (plist-get size :file)
;;      (fancy-splash-generate-image (or (plist-get size :template)
;;                                       fancy-splash-image-template)
;;                                   (plist-get size :height)))))
;;
;;(defun ensure-theme-splash-images-exist (&optional height)
;;  (unless (file-exists-p (fancy-splash-filename
;;                          (symbol-name doom-theme)
;;                          (or height
;;                              (plist-get (car fancy-splash-sizes) :height))))
;;    (fancy-splash-generate-images)))
;;
;;(defun get-appropriate-splash ()
;;  (let ((height (frame-height)))
;;    (cl-some (lambda (size) (when (>= height (plist-get size :min-height)) size))
;;             fancy-splash-sizes)))
;;
;;(setq fancy-splash-last-size nil)
;;(setq fancy-splash-last-theme nil)
;;(defun set-appropriate-splash (&rest _)
;;  (let ((appropriate-image (get-appropriate-splash)))
;;    (unless (and (equal appropriate-image fancy-splash-last-size)
;;                 (equal doom-theme fancy-splash-last-theme)))
;;    (unless (plist-get appropriate-image :file)
;;      (ensure-theme-splash-images-exist (plist-get appropriate-image :height)))
;;    (setq fancy-splash-image
;;          (or (plist-get appropriate-image :file)
;;              (fancy-splash-filename (symbol-name doom-theme) (plist-get appropriate-image :height))))
;;    (setq +doom-dashboard-banner-padding (plist-get appropriate-image :padding))
;;    (setq fancy-splash-last-size appropriate-image)
;;    (setq fancy-splash-last-theme doom-theme)
;;    (+doom-dashboard-reload)))
;;
;;(add-hook 'window-size-change-functions #'set-appropriate-splash )
;;(add-hook 'doom-load-theme-hook #'set-appropriate-splash )
#+end_src
* Org Mode
** Centaur Tabs
#+begin_src emacs-lisp
(after! centaur-tabs
  (centaur-tabs-mode -1)
  (setq centaur-tabs-height 36
        centaur-tabs-set-icons t
        centaur-tabs-modified-marker "o"
        centaur-tabs-close-button "×"
        centaur-tabs-set-bar 'above
        centaur-tabs-gray-out-icons 'buffer))
#+end_src
* Daemon Initialization
#+begin_src emacs-lisp
(defun greedily-do-daemon-setup ()
  (require 'org)
  (when (require 'mu4e nil t)
    (setq mu4e-confirm-quit t)
    (setq +mu4e-lock-greedy t)
    (setq +mu4e-lock-relaxed t)
    (+mu4e-lock-add-watcher)
    (when (+mu4e-lock-available t)
      (mu4e-start)))
  (when (require 'elfeed nil t)
    (run-at-time nil (* 8 60 60) #'elfeed-update )))

(when (daemonp)
  (add-hook 'emacs-startup-hook #'greedily-do-daemon-setup)
  (add-hook! 'server-after-make-frame-hook (switch-to-buffer +doom-dashboard-name)))
#+end_src
* Completion
** Company
#+begin_src emacs-lisp
(after! company
  (setq company-idle-delay 0.2
        company-minimum-prefix-length 1)
  (setq company-show-numbers t)
  (add-hook 'evil-normal-state-entry-hook #'company-abort ))
(setq-default history-length 1000)
(setq-default prescient-history-length 1000)
#+end_src
*** Plaintext
#+begin_src emacs-lisp
(set-company-backend!
  '(text-mode
    markdown-mode
    gfm-mode)
  '(:separate
    company-ispell
    company-files
    company-yasnippet))
#+end_src
*** ESS
#+begin_src emacs-lisp
(set-company-backend! 'ess-r-mode '(company-R-args company-R-objects company-dabbrev-code :separate))
#+end_src
* OEM Doom Emacs Packages (just docs on how package loading works)
#+begin_src emacs-lisp :tangle ./packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;(package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/raxod502/straight.el#the-recipe-format
;(package! another-package
;  :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;(package! this-package
;  :recipe (:host github :repo "username/repo"
;           :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;(package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;(package! builtin-package :recipe (:nonrecursive t))
;(package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see raxod502/straight.el#279)
;(package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;(package! builtin-package :pin "1a2b3c4d5e")


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;(unpin! pinned-package)
;; ...or multiple packages
;(unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;(unpin! t)
#+end_src
** Git Integration
*** Magit Delta - Diff syntax highlighter, written in rust. Requires `delta' binary
#+begin_src emacs-lisp :tangle ./packages.el
(package! magit-delta :recipe (:host github :repo "dandavison/magit-delta"))
#+end_src
** Org-Mode
*** Org Super Agenga
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! org-super-agenda :recipe (:host github :repo "alphapapa/org-super-agenda"))
#+end_src
