new_doom/config.org
**** config
#+begin_src emacs-lisp
(use-package! org-super-agenda
  :after org-agenda
  :init
  (setq org-agenda-skip-scheduled-if-done t
        org-agenda-skip-deadline-if-done t
        org-agenda-include-deadlines t
        org-agenda-block-separator nil
        org-agenda-compact-blocks t
        org-agenda-start-day nil        ; i.e. today
        org-agenda-span 1
        org-agenda-start-on-weekday nil)
  (setq org-agenda-custom-commands
        '(("c" "Super view"
           ((agenda "" ((org-agenda-overriding-header "")
                        (org-super-agenda-groups
                         '((:name "Today"
                            :time-grid t
                            :date today
                            :order 1)))))
            (alltodo "" ((org-agenda-overriding-header "")
                         (org-super-agenda-groups
                          '((:log t)
                            (:name "To Refile"
                             :file-path "refile\\.org")
                            (:name "Next To Do"
                             :todo "NEXT"
                             :order 1)
                            (:name "Important"
                             :priority "A"
                             :order 6)
                            (:name "Today's Task"
                             :file-path "journal/")
                            (:name "Due Today"
                             :deadline today
                             :order 2)
                            (:name "Scheduled Soon"
                             :scheduled future
                             :order 8)
                            (:name "Overdue"
                             :deadline past
                             :order 7)
                            (:name "Meetings"
                             :and (:todo "MEET" :scheduled future)
                             :order 10)
                            (:discard (:not (:todo "TODO")))))))))))
  :config
  (org-super-agenda-mode))
#+end_src
**** keybindings
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("j" . "journal")        ;; org-journal bindings
       :desc "Create new journal entry" "j" #'org-journal-new-entry
       :desc "Open previous entry" "p" #'org-journal-open-previous-entry
       :desc "Open next entry" "n" #'org-journal-open-next-entry
       :desc "Search journal" "s" #'org-journal-search-forever))
;; The built-in calendar mode mappings for org-journal
;; conflict with evil bindings
(map!
 (:map calendar-mode-map
  :n "o" #'org-journal-display-entry
  :n "p" #'org-journal-previous-entry
  :n "n" #'org-journal-next-entry
  :n "O" #'org-journal-new-date-entry ))
#+end_src
*** Org Pretty Table
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! org-pretty-table :recipe (:host github :repo "Fuco1/org-pretty-table"))
#+end_src
**** config
#+begin_src emacs-lisp
(use-package! org-pretty-table :commands (org-pretty-table-mode global-org-pretty-table-mode))
#+end_src
*** Org Appear
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! org-appear :recipe (:host github :repo "awth13/org-appear"))
#+end_src
*** Org Pretty Tags
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! org-pretty-tags)
#+end_src
*** Org Ol Tree
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! org-ol-tree :recipe (:host github :repo "Townk/org-ol-tree"))
#+end_src
**** config
#+begin_src emacs-lisp
(use-package! org-ol-tree
  :commands org-ol-tree)
(map! :map org-mode-map
      :after org
      :localleader
      :desc "Outline" "O" #'org-ol-tree)
#+end_src
*** Org Ref
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! org-ref)
#+end_src
*** Org Transclusion
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! org-transclusion :recipe (:host github :repo "nobiot/org-transclusion"))
#+end_src
**** config
#+begin_src emacs-lisp
(use-package! org-transclusion
  :commands org-transclusion-mode
  :init
  (map! :after org :map org-mode-map
        "<f12>" #'org-transclusion-mode ))
#+end_src
*** Org Graph View
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! org-graph-view :recipe (:host github :repo "alphapapa/org-graph-view"))
#+end_src
*** Org Chef
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! org-chef)
#+end_src
*** Org Roam Server
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! org-roam-server)
#+end_src
**** config
#+begin_src emacs-lisp
(use-package! org-roam-server
  :after (org-roam server)
  :config
  (setq org-roam-server-host "127.0.0.1"
        org-roam-server-port 8078
        org-roam-server-export-inline-image t
        org-roam-server-authenticate nil
        org-roam-server-network-label-truncate t
        org-roam-server-network-label-truncate-length 60
        org-roam-server-network-label-wrap-length 20)
  (defun org-roam-server-open ()
    "Ensure the server is active, then open the roam graph."
    (interactive)
    (org-roam-server-mode 1)
    (browse-url-xdg-open (format "http://localhost:%d" org-roam-server-post))))
#+end_src
** Misc
*** Info Colors - Colored man pages
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! info-colors)
#+end_src
*** Page Break Lines - Prettier page break lines
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! page-break-lines :recipe (:host github :repo "purcell/page-break-lines"))
#+end_src
**** config
#+begin_src emacs-lisp
(use-package! page-break-lines
  :commands page-break-lines-mode
  :init
  (autoload 'turn-on-page-break-lines-mode "page-break-lines")
  :config
  (setq page-break-lines-max-width fill-column)
  (map! :prefix "g"
        :desc "Prev page break" :nv "[" #'backward-page
        :desc "Next page break" :nv "]" #'forward-page ))
#+end_src
*** Ox GFM
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! ox-gfm)
#+end_src
**** config
#+begin_src emacs-lisp
(use-package! ox-gfm :after org)
#+end_src
*** Systemd - For editing systemd unit files
#+begin_src emacs-lisp :tangle ./packages.el
(package! systemd)
#+end_src
*** Authinfo Color Mode
**** package
#+begin_src emacs-lisp :tangle ./packages.el
(package! authinfo-color-mode :recipe (:host github :repo "tecosaur/authinfo-color-mode"))
#+end_src
**** config
#+begin_src emacs-lisp
(use-package! authinfo-color-mode
  :mode ("authinfo.gpg\\'" . authinfo-color-mode)
  :init (advice-add 'authinfo-mode :override #'authinfo-color-mode ))
#+end_src
*** Elcord
#+begin_src emacs-lisp
(setq elcord-use-major-mode-as-main-icon t)
#+end_src
*** Emojify
**** Emoji set
#+begin_src emacs-lisp
(setq emojify-emoji-set "twemoji-v2")
#+end_src
**** config - getting rid of emojis that override preferred characters
#+begin_src emacs-lisp
(defvar emojify-disabled-emojis
  '(;; Org
    "◼" "☑" "☸" "⚙" "⏩" "⏪" "⬆" "⬇" "❓"
    ;; Terminal powerline
    "✔"
    ;; Box drawing
    "▶" "◀")
  "Characters that should never be affected by `emojify-mode'.")

(defadvice! emojify-delete-from-data ()
  "Ensure `emojify-disabled-emojis' don't appear in `emojify-emojis'."
  :after #'emojify-set-emoji-data
  (dolist (emoji emojify-disabled-emojis)
    (remhash emoji emojify-emojis)))
;; hook new minor mode to email an irc
(add-hook! '(mu4e-compose-mode org-msg-edit-mode circe-channel-mode) (emoticon-to-emoji 1))
#+end_src
*** Eros-Eval
#+begin_src emacs-lisp
(setq eros-eval-result-prefix "⟹ ")
#+end_src
* Doom Modeline
#+begin_src emacs-lisp
(after! doom-modeline
  (doom-modeline-def-segment buffer-name
    "Display the current buffer's name, without any other information."
    (concat
     (doom-modeline-spc)
     (doom-modeline--buffer-name)))
  (doom-modeline-def-segment pdf-icon
    "PDF icon from all-the-icons."
    (concat
     (doom-modeline-spc)
     (doom-modeline-icon 'octicon "file-pdf" nil nil
                         :face (if (doom-modeline--active)
                                   'all-the-icons-red
                                 'mode-line-inactive)
                         :v-adjust 0.02)))
  (defun doom-modeline-update-pdf-pages ()
    "Update PDF pages."
    (setq doom-modeline--pdf-pages
          (let ((current-page-str (number-to-string (eval `(pdf-view-current-page))))
                (total-page-str (number-to-string (pdf-cache-number-of-pages))))
            (concat
             (propertize
              (concat (make-string (- (length total-page-str) (length current-page-str)) ? )
                      " P" current-page-str)
              'face 'mode-line)
             (propertize (concat "/" total-page-str) 'face 'doom-modeline-buffer-minor-mode)))))
  (doom-modeline-def-modeline 'pdf
    '(bar window-number pdf-pages pdf-icon buffer-name)
    '(misc-info matches major-mode process vcs)))
#+end_src
