new_doom/config.org
* Emacs Everywhere
#+begin_src emacs-lisp
(use-package! emacs-everywhere
  :if (daemonp)
  :config
  (require 'spell-fu)
  (setq emacs-everywhere-major-mode-function #'org-mode
        emacs-everywhere-frame-name-format "Edit ∷ %s — %s")
  (defadvice! emacs-everywhere-raise-frame ()
    :after #'emacs-everywhere-set-frame-name
    (setq emacs-everywhere-frame-name (format emacs-everywhere-frame-name-format
                                              (emacs-everywhere-app-class emacs-everywhere-current-app)
                                              (truncate-string-to-width
                                               (emacs-everywhere-app-title emacs-everywhere-current-app)
                                               45 nil nil "…")))
    ;; need to wait until frame refresh happens before really set
    (run-with-timer 0.1 nil #'emacs-everywhere-raise-frame-1 ))
  (defun emacs-everywhere-raise-frame-1 ()
    (call-process "wmctrl" nil nil nil "-a" emacs-everywhere-frame-name)))
#+end_src
* Keybindings
#+begin_src emacs-lisp
;: `
#+end_src
